# # 19.  Ввести строку и букву,
# # вывести только слова, начинающиеся с заданной буквы.
#
# 3 лаба
# string_ = input().split()
# letter_ = input()
# print(*[i for i in string_ if i[0] == letter_])
#
#
# 19.	Реализовать модуль, содержащий функцию, которая в массиве вещественных чисел
# обнуляет все элементы, которые больше среднего арифметического значения элементов
# исходного массива.
from module import function

lis = [1, 2, 3, 4, 5, 6, 7]
print(function(lis))  # Сложность 7
